ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-McuLink-Pro/MCU-Link-Pro_Measurement/board/pin_mux.c
    gpio_pin_config_t trig_gpio_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_6 (pin 89)  */
    GPIO_PinInit(BOARD_INITPINS_trig_gpio_GPIO, BOARD_INITPINS_trig_gpio_PORT, BOARD_INITPINS_trig_gpio_PIN, &trig_gpio_config);

    gpio_pin_config_t curr_meas_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_16 (pin 14)  */
    GPIO_PinInit(GPIO, 0U, 16U, &curr_meas_config);

    gpio_pin_config_t ctrl_highcurr_en_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_17 (pin 8)  */
    GPIO_PinInit(BOARD_INITPINS_ctrl_highcurr_en_GPIO, BOARD_INITPINS_ctrl_highcurr_en_PORT, BOARD_INITPINS_ctrl_highcurr_en_PIN, &ctrl_highcurr_en_config);

    gpio_pin_config_t ctrl_highcurr_dis_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 1U
    };
    /* Initialize GPIO functionality on pin PIO0_29 (pin 92)  */
    GPIO_PinInit(BOARD_INITPINS_ctrl_highcurr_dis_GPIO, BOARD_INITPINS_ctrl_highcurr_dis_PORT, BOARD_INITPINS_ctrl_highcurr_dis_PIN, &ctrl_highcurr_dis_config);

    gpio_pin_config_t ctrl_cal_r1_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_22 (pin 41)  */
    GPIO_PinInit(BOARD_INITPINS_ctrl_cal_r1_GPIO, BOARD_INITPINS_ctrl_cal_r1_PORT, BOARD_INITPINS_ctrl_cal_r1_PIN, &ctrl_cal_r1_config);

    gpio_pin_config_t ctrl_cal_r2_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_23 (pin 42)  */
    GPIO_PinInit(BOARD_INITPINS_ctrl_cal_r2_GPIO, BOARD_INITPINS_ctrl_cal_r2_PORT, BOARD_INITPINS_ctrl_cal_r2_PIN, &ctrl_cal_r2_config);

    gpio_pin_config_t ctrl_cal_disc_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_24 (pin 3)  */
    GPIO_PinInit(BOARD_INITPINS_ctrl_cal_disc_GPIO, BOARD_INITPINS_ctrl_cal_disc_PORT, BOARD_INITPINS_ctrl_cal_disc_PIN, &ctrl_cal_disc_config);

    gpio_pin_config_t ctrl_cal_r3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_26 (pin 68)  */
    GPIO_PinInit(BOARD_INITPINS_ctrl_cal_r3_GPIO, BOARD_INITPINS_ctrl_cal_r3_PORT, BOARD_INITPINS_ctrl_cal_r3_PIN, &ctrl_cal_r3_config);

    gpio_pin_config_t ctrl_cal_r4_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_29 (pin 80)  */
    GPIO_PinInit(BOARD_INITPINS_ctrl_cal_r4_GPIO, BOARD_INITPINS_ctrl_cal_r4_PORT, BOARD_INITPINS_ctrl_cal_r4_PIN, &ctrl_cal_r4_config);
    /* PIO0_6 is selected for PINT input 0 */
    INPUTMUX_AttachSignal(INPUTMUX, 0U, kINPUTMUX_GpioPort0Pin6ToPintsel);

    IOCON->PIO[0][16] = ((IOCON->PIO[0][16] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK | IOCON_PIO_ASW_MASK)))

                         /* Selects pin function.
                          * : PORT016 (pin 14) is configured as ADC0_8. */
                         | IOCON_PIO_FUNC(PIO0_16_FUNC_ALT0)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Inactive.
                          * Inactive (no pull-down/pull-up resistor enabled). */
                         | IOCON_PIO_MODE(PIO0_16_MODE_INACTIVE)

                         /* Select Digital mode.
                          * : Disable digital mode.
                          * Digital input set to 0. */
                         | IOCON_PIO_DIGIMODE(PIO0_16_DIGIMODE_ANALOG)

                         /* Analog switch input control.
                          * : For all pins except PIO0_9, PIO0_11, PIO0_12, PIO0_15, PIO0_18, PIO0_31, PIO1_0 and
                          * PIO1_9 analog switch is closed (enabled). */
                         | IOCON_PIO_ASW(PIO0_16_ASW_VALUE1));

    IOCON->PIO[0][17] = ((IOCON->PIO[0][17] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT017 (pin 8) is configured as PIO0_17. */
                         | IOCON_PIO_FUNC(PIO0_17_FUNC_ALT0)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_17_DIGIMODE_DIGITAL));

    IOCON->PIO[0][24] = ((IOCON->PIO[0][24] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT024 (pin 70) is configured as FC0_RXD_SDA_MOSI_DATA. */
                         | IOCON_PIO_FUNC(PIO0_24_FUNC_ALT1)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-down.
                          * Pull-down resistor enabled. */
                         | IOCON_PIO_MODE(PIO0_24_MODE_PULL_DOWN)

                         /* Select Digital mode.
                          * : Enable Digital mode.
                          * Digital input is enabled. */
                         | IOCON_PIO_DIGIMODE(PIO0_24_DIGIMODE_DIGITAL));

    IOCON->PIO[0][25] = ((IOCON->PIO[0][25] &
                          /* Mask bits to zero which are setting */
                          (~(IOCON_PIO_FUNC_MASK | IOCON_PIO_MODE_MASK | IOCON_PIO_DIGIMODE_MASK)))

                         /* Selects pin function.
                          * : PORT025 (pin 79) is configured as FC0_TXD_SCL_MISO_WS. */
                         | IOCON_PIO_FUNC(PIO0_25_FUNC_ALT1)

                         /* Selects function mode (on-chip pull-up/pull-down resistor control).
                          * : Pull-down.
                          * Pull-down resistor enabled. */
                         | IOCON_PIO_MODE(PIO0_25_MODE_PULL_DOWN)

